In [1]:
#2 Import pandas:
import pandas as pd

In [2]:
#3 Next, load the CSV file as a DataFrame with the header parameter set to None :
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Pandas-Workshop/master/Chapter06/Data/messy_addresses.csv'
data_frame = pd.read_csv(file_url, header=None)

In [3]:
#4 Use the head() function to display the first 5 rows of the DataFrame:
data_frame.head()

,0,1,2,3
0,Vernia Anthony,"1051 Balceta Square, Reedley, Michigan",Vernia Anthony,"1051 Balceta Square, Reedley, Michigan"
1,Daren Underwood,"982 Duboce Gardens, Peachtree City, Georgia",Daren Underwood,"982 Duboce Gardens, Peachtree City, Georgia"
2,Stanley Marks,"541 Merrill Stravenue, Talladega, Pennsylvania",Stanley Marks,"541 Merrill Stravenue, Talladega, Pennsylvania"
3,Shad Ruiz,"1018 Whiting Line, North Platte, New Jersey",Shad Ruiz,"1018 Whiting Line, North Platte, New Jersey"
4,Danny Mooney,"1301 Grand View Crescent, Oviedo, Washington",Danny Mooney,"1301 Grand View Crescent, Oviedo, Washington"

In [4]:
#5 Use the tail() function to display the last 5 rows of the DataFrame:
data_frame.tail(5)

,0,1,2,3
45,Augustus Conley,"421 Powhattan Sideline, Caldwell, Mississippi",Augustus Conley,"421 Powhattan Sideline, Caldwell, Mississippi"
46,Lyndia Humphrey,"323 Lori Plantation, Vernon Hills, Oregon",Lyndia Humphrey,"323 Lori Plantation, Vernon Hills, Oregon"
47,Vito Cochran,"136 Dr Tom Waddell Bypass, Pembroke Pines, New...",Vito Cochran,"136 Dr Tom Waddell Bypass, Pembroke Pines, New..."
48,Preston Randall,"1178 Burke Boulevard, Sugar Land, Oklahoma",Preston Randall,"1178 Burke Boulevard, Sugar Land, Oklahoma"
49,Derrick Holman,"401 Cayuga Viaduct, Pittsburg, Indiana",Derrick Holman,"401 Cayuga Viaduct, Pittsburg, Indiana"

In [5]:
#6 Delete the duplicate columns then display the first 5 rows of the DataFrame
data_frame.drop([2,3], axis=1, inplace=True)
data_frame.head()

                 0                                               1
0   Vernia Anthony          1051 Balceta Square, Reedley, Michigan
1  Daren Underwood     982 Duboce Gardens, Peachtree City, Georgia
2    Stanley Marks  541 Merrill Stravenue, Talladega, Pennsylvania
3        Shad Ruiz     1018 Whiting Line, North Platte, New Jersey
4     Danny Mooney    1301 Grand View Crescent, Oviedo, Washington

In [6]:
#7 Create list of column headers
column_names = ["full_name", "address"]
print(column_names)

['full_name', 'address']

In [7]:
#8 Replace the missing column headers then display the DataFrame
data_frame.columns = column_names
data_frame.head()

         full_name                                         address
0   Vernia Anthony          1051 Balceta Square, Reedley, Michigan
1  Daren Underwood     982 Duboce Gardens, Peachtree City, Georgia
2    Stanley Marks  541 Merrill Stravenue, Talladega, Pennsylvania
3        Shad Ruiz     1018 Whiting Line, North Platte, New Jersey
4     Danny Mooney    1301 Grand View Crescent, Oviedo, Washington

In [8]:
#9 Split the values of “full_name” into 2 columns called “first_name” and “last_name”) then display the DataFrame:
data_frame[['first_name','last_name']]=data_frame.full_name.str.split(expand=True)
data_frame.head()

,full_name,address,first_name,last_name
0,Vernia Anthony,"1051 Balceta Square, Reedley, Michigan",Vernia,Anthony
1,Daren Underwood,"982 Duboce Gardens, Peachtree City, Georgia",Daren,Underwood
2,Stanley Marks,"541 Merrill Stravenue, Talladega, Pennsylvania",Stanley,Marks
3,Shad Ruiz,"1018 Whiting Line, North Platte, New Jersey",Shad,Ruiz
4,Danny Mooney,"1301 Grand View Crescent, Oviedo, Washington",Danny,Mooney

In [9]:
#10 Delete the "full_name" column then display the DataFrame:
data_frame.drop('full_name', axis=1, inplace=True)
data_frame.head()

                                          address first_name  last_name
0          1051 Balceta Square, Reedley, Michigan     Vernia    Anthony
1     982 Duboce Gardens, Peachtree City, Georgia      Daren  Underwood
2  541 Merrill Stravenue, Talladega, Pennsylvania    Stanley      Marks
3     1018 Whiting Line, North Platte, New Jersey       Shad       Ruiz
4    1301 Grand View Crescent, Oviedo, Washington      Danny     Mooney

In [10]:
#11 Split the values of "address" into 3 new columns called "street", "city","state" then display the DataFrame:
data_frame[['street', 'city','state']] = data_frame.address.str.split(pat = ", ", expand=True)
data_frame.head()

,address,first_name,last_name,street,city,state
0,"1051 Balceta Square, Reedley, Michigan",Vernia,Anthony,1051 Balceta Square,Reedley,Michigan
1,"982 Duboce Gardens, Peachtree City, Georgia",Daren,Underwood,982 Duboce Gardens,Peachtree City,Georgia
2,"541 Merrill Stravenue, Talladega, Pennsylvania",Stanley,Marks,541 Merrill Stravenue,Talladega,Pennsylvania
3,"1018 Whiting Line, North Platte, New Jersey",Shad,Ruiz,1018 Whiting Line,North Platte,New Jersey
4,"1301 Grand View Crescent, Oviedo, Washington",Danny,Mooney,1301 Grand View Crescent,Oviedo,Washington

In [11]:
#12 Delete the "address" column then display the DataFrame:
data_frame.drop('address', axis=1, inplace=True)
data_frame.head()

,first_name,last_name,street,city,state
0,Vernia,Anthony,1051 Balceta Square,Reedley,Michigan
1,Daren,Underwood,982 Duboce Gardens,Peachtree City,Georgia
2,Stanley,Marks,541 Merrill Stravenue,Talladega,Pennsylvania
3,Shad,Ruiz,1018 Whiting Line,North Platte,New Jersey
4,Danny,Mooney,1301 Grand View Crescent,Oviedo,Washington